UTAF_Base/requestFiles/BPS_Account_CreateExt.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v2.account.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
          <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         <!--Optional:-->
         <urn:endUserId>id000000</urn:endUserId>
         <!--Optional:-->
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <!--Optional:-->
         <urn:propagatedKey>?</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataCreateExt version="2.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id000000</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:partyId>${Req_partyId}</urn1:partyId>
         <urn1:parentAccountId>${Req_parentAccountId}</urn1:parentAccountId>
         <urn1:legalLangIso2Code>${Req_legalLangIso2Code}</urn1:legalLangIso2Code>
         <urn1:communicationLangIso2Code>${Req_communicationLangIso2Code}</urn1:communicationLangIso2Code>
         <urn1:legalFormCode>${Req_legalFormCode}</urn1:legalFormCode>
         <urn1:titleCode>${Req_titleCode}</urn1:titleCode>
         <urn1:subTitleDescr>${Req_subTitleDescr}</urn1:subTitleDescr>
         <urn1:name>${Req_name}</urn1:name>
         <urn1:firstName>${Req_firstName}</urn1:firstName>
         <urn1:printName>${Req_printName}</urn1:printName>
         <urn1:streetCode>${Req_streetCode}</urn1:streetCode>
         <urn1:residenceName>${Req_residenceName}</urn1:residenceName>
         <urn1:industrialZone>${Req_industrialZone}</urn1:industrialZone>
         <urn1:houseNbr>${Req_houseNbr}</urn1:houseNbr>
         <urn1:alphaHouseNbr>${Req_alphaHouseNbr}</urn1:alphaHouseNbr>
         <urn1:boxNbr>${Req_boxNbr}</urn1:boxNbr>
         <urn1:apartmentNbr>${Req_apartmentNbr}</urn1:apartmentNbr>
         <urn1:blockNbr>${Req_blockNbr}</urn1:blockNbr>
         <urn1:floorNbr>${Req_floorNbr}</urn1:floorNbr>
         <urn1:cityCode>${Req_cityCode}</urn1:cityCode>
         <urn1:countryIso3Code>${Req_countryIso3Code}</urn1:countryIso3Code>
         <urn1:bankAccountCountryIso3Code>${Req_bankAccountCountryIso3Code}</urn1:bankAccountCountryIso3Code>
         <urn1:bankAccountNbr>${Req_bankAccountNbr}</urn1:bankAccountNbr>
         <urn1:careOfInd>${Req_careOfInd}</urn1:careOfInd>
         <urn1:mainKey>${Req_mainKey}</urn1:mainKey>
         <urn1:subKey>${Req_subKey}</urn1:subKey>
      </urn1:RequestDataCreateExt>
   </soapenv:Body>
</soapenv:Envelope>